Управление_по_целям_и_KPI/src/InformationRegisters/KPI_ФотоСотрудников/KPI_ФотоСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>KPI_ФотоСотрудников</name>
  <resources>
    <name>Фото</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ФотоСсылка</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_по_целям_и_KPI/src/InformationRegisters/KPI_ФотоСотрудников/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
		
	Если Параметры.Свойство("ОбъектУправления") Тогда
		
		Сотрудник = Неопределено;
		Если Параметры.Свойство("Период") Тогда
			Сотрудник = KPI_ОбщегоНазначенияСервер.ПолучитьСотрудникаПоСтруктуреКомпанииНаДату(
			Параметры.ОбъектУправления,Параметры.Период);
		Иначе 
			Сотрудник = KPI_ОбщегоНазначенияСервер.ПолучитьСотрудникаПоСтруктуреКомпанииНаДату(
			Параметры.ОбъектУправления,Параметры.Период);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Сотрудник) Тогда
			Запись.ФизЛицо = Сотрудник.ФизическоеЛицо;
		КонецЕсли;
		
	Иначе 
		
		Попытка
			Запись.ФизЛицо = Параметры.ТекущийСотрудник.ФизическоеЛицо;
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
	
	ФотоФизЛицаСсылка = ПолучитьНавигационнуюСсылку(ПолучитьКлючЗаписиНаСервере(), "Фото");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКлючЗаписиНаСервере()
	мЗапись = РегистрыСведений.KPI_ФотоСотрудников.СоздатьМенеджерЗаписи();
	мЗапись.ФизЛицо = Запись.ФизЛицо;
	мЗапись.Прочитать();	   	
	
	Возврат РегистрыСведений.KPI_ФотоСотрудников.СоздатьКлючЗаписи(Новый Структура("ФизЛицо", мЗапись.ФизЛицо) );
КонецФункции

&НаСервере
Функция ЗаписьСуществует(Физ)
	
	мЗапись = РегистрыСведений.KPI_ФотоСотрудников.СоздатьМенеджерЗаписи();
	мЗапись.ФизЛицо = Физ;
	мЗапись.Прочитать();
	
	Если мЗапись.ФизЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
		Возврат Ложь;
	Иначе 
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ФизЛицоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Запись.ФизЛицо) И ЗаписьСуществует(Запись.ФизЛицо) Тогда
		Предупреждение("Нельзя изменить текущее физ. лицо. Создайте новую запись для другого физ. лица");
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
КонецПроцедуры
          
&НаКлиенте
Процедура ФизЛицоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ЗаписьСуществует(ВыбранноеЗначение) Тогда
		Предупреждение("Нельзя выбрать данное Физ.лицо, т.к. оно уже есть в списке объектов");
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтаФорма.Модифицированность Тогда
		Если Не ФотоФизЛицаСсылка = "" Тогда
			
			Если ЗаписьСуществует(Запись.ФизЛицо) Тогда
				мЗапись         = РегистрыСведений.KPI_ФотоСотрудников.СоздатьМенеджерЗаписи();
				мЗапись.ФизЛицо = Запись.ФизЛицо;
				мЗапись.Удалить();
			КонецЕсли;
			
		    ДвоичДанные = ПолучитьИзВременногоХранилища(ФотоФизЛицаСсылка);
			ТекущийОбъект.Фото = Новый ХранилищеЗначения(ДвоичДанные, Новый СжатиеДанных(7));
			
		Иначе
			ТекущийОбъект.Фото = Новый ХранилищеЗначения(Неопределено);
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьФото(Команда)
	
	ФотоФизЛицаСсылка = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФото(Команда)
	
	СтандартнаяОбработка = Ложь;
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	Диалог = Новый ДиалогВыбораФайла(Режим);
	Диалог.Заголовок = "Выберите файл с фотографией";
	Диалог.ПредварительныйПросмотр = Истина;
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Фильтр = 
	"Все картинки (*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.gif;*.png;*.ico;*.wmf;*.emf)|*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.gif;*.png;*.ico;*.wmf;*.emf|" 
	+ "Формат bmp (*.bmp;*.dib;*.rle)|*.bmp;*.dib;*.rle|"
	+ "Формат JPEG (*.jpg;*.jpeg)|*.jpg;*.jpeg|"
	+ "Формат TIFF (*.tif)|*.tif|"
	+ "Формат GIF (*.gif)|*.gif|"
	+ "Формат PNG (*.png)|*.png|"
	+ "Формат icon (*.ico)|*.ico|"
	+ "Формат метафайл (*.wmf;*.emf)|*.wmf;*.emf|";
	
	Если Диалог.Выбрать() Тогда
		АдресВХранилище = "";
		
		Если ПоместитьФайл(АдресВХранилище, Диалог.ПолноеИмяФайла, , Ложь, Новый УникальныйИдентификатор) Тогда
			
			ФотоФизЛицаСсылка = АдресВХранилище;
			Модифицированность = Истина;
			
		КонецЕсли;	
	Иначе
		Возврат;
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Запись.ФизЛицо) Тогда
		Элементы.ФизЛицо.Доступность = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	мЗапись = РегистрыСведений.KPI_ФотоСотрудников.СоздатьМенеджерЗаписи();
	мЗапись.ФизЛицо = ТекущийОбъект.ФизЛицо;
	мЗапись.Прочитать();
	
	мЗапись.ФотоСсылка = ПолучитьНавигационнуюСсылку(ПолучитьКлючЗаписиНаСервере(), "Фото");
	мЗапись.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("РС_ФотоСотрудников_ОбновитьФотографию");
	
КонецПроцедуры
